# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 10
b = 10.5
c = 'hello'
d = [a, b, c]
e = {'hello' : a}

print(f'объект {a} имеет тип данных {type(a)}')
print(f'объект {b} имеет тип данных {type(b)}')
print(f'объект {c} имеет тип данных {type(c)}')
print(f'объект {d} имеет тип данных {type(d)}')
print(f'объект {e} имеет тип данных {type(e)}')